# IFC_ClearAllPsets

## Description
Removes all IFC Psets

```pascal
FUNCTION IFC_ClearAllPsets(hObject : HANDLE) : BOOLEAN;
```

```python

def vs.IFC_ClearAllPsets(hObject):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||

## Version
Availability: from Vectorworks 2016
## Category
* IFC